Revit 2027 API
BuiltInFailures.PointFailures.HostParameterRangeError Property
 Hosted Parameter must be between 0 and 1
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostParameterRangeError { get; }
Public Shared ReadOnly Property HostParameterRangeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostParameterRangeError {
	FailureDefinitionId^ get ();
}
static member HostParameterRangeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace